### Creating dataframes using different methods

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

### Finding Datatype

In [2]:
myseries = pd.Series(['bot','chatgpt'])
print(myseries.dtype)

object

In [3]:
myseries1 = pd.Series([100.5,22,55,66,77889])
print(myseries1.dtype)

float64

### Converting to List

In [10]:
print(myseries.to_list())

['bot', 'chatgpt']

### Pandas Dataframe

In [11]:
mydf = pd.DataFrame()
print(mydf)

Empty DataFrame
Columns: []
Index: []

#### 1. Dataframe using list of lists

In [6]:
profession = [['Cardiologist', 1000000], ['Data Engineer',1500000],['Architect',5000000],\
              ['Data scientist',2500000],['Python devoloper',1500000],['Front office admin',25000]]
prof_salary_df = pd.DataFrame( profession , columns = ['Profession' , 'Salary'])
prof_salary_df

           Profession   Salary
0        Cardiologist  1000000
1       Data Engineer  1500000
2           Architect  5000000
3      Data scientist  2500000
4    Python devoloper  1500000
5  Front office admin    25000

#### 2. Dataframe using dictionaries

In [7]:
capital_languages = {'States':[ 'Kerala', 'Tamil Nadu', 'Karnataka' , 'Goa', 'MadhyaPradesh', 'Assam', \
                             'Punjab', 'Odisha'],
                    'capital': ['Thiruvananthapuram', 'Chennai', 'Bengaluru', \
                               'Panaji', 'Bhopal','Dispur','Chandigarh', 'Bhuvaneswar'],
                    'Languages':['Malayalam', 'Tamil', 'Kannada' ,'Konkani', 'Hindi','Assamese',
                                 'Punjabi', 'oriya']}
state_df = pd.DataFrame(capital_languages)
state_df

          States             capital  Languages
0         Kerala  Thiruvananthapuram  Malayalam
1     Tamil Nadu             Chennai      Tamil
2      Karnataka           Bengaluru    Kannada
3            Goa              Panaji    Konkani
4  MadhyaPradesh              Bhopal      Hindi
5          Assam              Dispur   Assamese
6         Punjab          Chandigarh    Punjabi
7         Odisha         Bhuvaneswar      oriya

#### Dataframe using list of dictionaries

In [8]:
india_timeline = [ {'Year': 1857 , 'Incident':'First War of Indian Independence'},
                  {'Year':1905,'Incident':'Partition of Bengal'},
                 {'Year' :1912,'Incident':'Delhi-Lahore conspiracy case'},
                 {'Year': 1919,'Incident': 'Jalianwala Bagh Tragedy'},
                 {'Year':1920, 'Incident':'First non-co-operation movement'}]
india_df = pd.DataFrame(india_timeline)
india_df

   Year                          Incident
0  1857  First War of Indian Independence
1  1905               Partition of Bengal
2  1912      Delhi-Lahore conspiracy case
3  1919           Jalianwala Bagh Tragedy
4  1920   First non-co-operation movement

In [16]:
names=[['Parvathy','Kollam'], ['Revathy', 'Pathanmthitta'] ,['Suhaina', 'Trivandrum']]
name_place_df =  pd.DataFrame(names ,columns =['name' , 'place'])
name_place_df

       name          place
0  Parvathy         Kollam
1   Revathy  Pathanmthitta
2   Suhaina     Trivandrum